<h1 style="color:red">What is pandas</h1>
<p>Pandas is an open source library in python used mainly for the purpose of data analysis, data manipulation and data exploration</p>

<p><i>[pandas] is derived from the term "panel data", an econometrics term for data sets that include observations over multiple time periods for the same individuals. — Wikipedia</i></p>

<img src="https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcShYvd6EGuSC3rbnEC0S-uyyVJdeuBDJnB8oUoKzeVXgj_Rx34A"/>

<p>The readme in the official pandas github repository describes pandas as “a Python package providing <b>fast, flexible, and expressive data structures designed to make working with “relational” or “labeled” data both easy and intuitive</b>. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python. Additionally, it has the broader goal of becoming the most powerful and flexible open source data analysis / manipulation tool available in any language.</p>

<h3>When can I use pandas?</h3>
<p>
    a. Calculate statistics and answer questions about the data, like<br>
        ------- What's the average, median, max, or min of each column?<br>
        ------- Does column A correlate with column B?<br>
        ------- What does the distribution of data in column C look like?<br>
    b. Clean the data by doing things like removing missing values and filtering rows or columns by some criteria<br>
    c. Visualize the data with help from Matplotlib. Plot bars, lines, histograms, bubbles, and more.<br>
    d. Store the cleaned, transformed data back into a CSV, other file or database<br>
</p>

<h3>What is so great about Pandas?</h3>
<p>
    1. It has got tons of functionality to help you in every possible scenario.<br>
    2. Kickass documentation<br>
    3. Open Source - Active community and active development.<br>
    4. Plays well with other libraries like numpy and scikit.learn<br>
    
    
</p>


<h3>Pandas Popularity</h3>
<img src="https://storage.googleapis.com/lds-media/images/the-rise-in-popularity-of-pandas.width-1200.png"/>

<h1 style="color:red">Importing Stuff</h1>

#### 1. Import Libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

#### 2. Import Datasets

In [2]:
match=pd.read_csv('matches.csv')
delivery=pd.read_csv('deliveries.csv')
company=pd.read_csv('Fortune501.csv')
titanic=pd.read_csv('titanic.csv')
food=pd.read_csv('food.csv')

In [3]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

<h1 style="color:red">Series and Dataframes</h1>

<img src="https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcRK5vl7PcWTN02CXdNczGUYxwtuJRwuAueqfhzzca4Jq6RjH2CZ"/>

#### 1. The Shape attribute

In [4]:
match.shape

(636, 18)

#### 2. The columns attribute

In [5]:
food.columns

Index(['Name', 'Gender', 'City', 'Frequency', 'Item', 'Spends'], dtype='object')

#### 3. The head() and tail() method

In [6]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
titanic.tail(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

#### 4. The info() method

In [8]:
match['dl_applied']=match['dl_applied'].astype('category')
match.info()
match.astype()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 636 entries, 0 to 635
Data columns (total 18 columns):
id                 636 non-null int64
season             636 non-null int64
city               629 non-null object
date               636 non-null object
team1              636 non-null object
team2              636 non-null object
toss_winner        636 non-null object
toss_decision      636 non-null object
result             636 non-null object
dl_applied         636 non-null category
winner             633 non-null object
win_by_runs        636 non-null int64
win_by_wickets     636 non-null int64
player_of_match    633 non-null object
venue              636 non-null object
umpire1            635 non-null object
umpire2            635 non-null object
umpire3            0 non-null float64
dtypes: category(1), float64(1), int64(4), object(12)
memory usage: 85.3+ KB

TypeError: astype() missing 1 required positional argument: 'dtype'

#### 5. The describe() method

In [ ]:
titanic.describe()

#### 6. The nunique/unique() method

In [ ]:
match['team1'].unique()

In [ ]:
match.nunique()

#### 7. The astype() method

#### 8. Extracting one column

In [ ]:
titanic['Age']

#### 9. Extracting multiple columns

In [ ]:
titanic[['Age','Name','Pclass']]

#### 10. Creating a new column

In [ ]:
titanic['Family'] = "None"

#### 11. Extracting one row

In [ ]:
titanic.iloc[::2,[0,2,3,4]]

#### 12. Extracting multiple rows

In [ ]:
#done

#### 13. Extracting both rows and columns

In [ ]:
#done

#### 14. The value_counts() method

In [ ]:
#x = match['player_of_match'].value_counts()
#x[3:6]
match[match['city']=="Kolkata"].head(2)

In [ ]:
mask1 = match['season']==2008
mask2 = match['city']=='Kolkata'
#match[mask1 & mask2].shape[0]
mask1

In [ ]:
match.shape[1]

#### 15. Filtering data based on a condition

#### 16. Filtering data based on multiple conditions

<h3 style="color:#00a65a">Exercise 1 : Find the total number of matches that have been played in the IPL</h3>

<h3 style="color:#00a65a">Exercise 2 : Find the top 5 teams in terms of number of matches won</h3>

In [ ]:
match['winner'].value_counts().head(5)

<h3 style="color:#00a65a">Exercise 3 : At which venue most number of matches have been played?</h3>

In [ ]:
match['venue'].value_counts().head(1)

#### 17. The plot() method

In [ ]:
match['venue'].value_counts().head().plot(kind='bar')

<h3 style="color:#00a65a">Exercise 4 : Find the top 5 teams who have played the most number of matches?</h3>

In [ ]:
a = match['team1'].value_counts()
b = match['team2'].value_counts()
c = a+b
#(a+b).sort_values(ascending=False)

<h3 style="color:#00a65a">Exercise 5 : Find the player who has won the most number of player of the match award in Chennai?</h3>

In [ ]:
#match[match['city'] == 'Chennai']['player_of_match'].value_counts().head(1)
ct = match['city'] == 'Chennai'
x = match[ct]
x['player_of_match'].value_counts().head(2)

<h3 style="color:#00a65a">Exercise 6 : What percentage of teams opt to bat first after winning the toss?</h3>

#### 18. The sort_values() method

In [ ]:
#done

#### 19. The set_index() method

In [ ]:
match.set_index('id').head(2)

#### 20. The inplace parameter

In [ ]:
#match.set_index('id',inplace=False)

#### 21. The sort_index() method

In [ ]:
#match.sort_index(ascending=False)

#### 22. The reset_index() method

In [ ]:
#match.reset_index()

#### 23. Maths functions

In [ ]:
match['season'].min()

#### 24. The drop_duplicates() method

In [ ]:
temp = match.drop_duplicates(subset=['season'],keep='last')
temp[['season','team1','team2','winner']].head(10)

In [ ]:
#newlines added to this jupiter notebook.

In [ ]:
def check(team_1,team_2):
    sub_match = match[['team1','team2','winner']]
    team1_df = sub_match[(sub_match['team1']==team_1) | (sub_match['team2']==team_1)] 
    team2_df = team1_df[(team1_df['team1']==team_2) | (team1_df['team2']==team_2)]
    lin = team2_df.shape
    print(f'There was {lin[0]} matches played between these two teams.\n')
    print('No. of time each team won is given below :- \n')
    print(team2_df['winner'].value_counts())
    #print(team2_df.shape)
    
    

check('Rajasthan Royals','Sunrisers Hyderabad')

<h3 style="color:#555555">Exercise 7 : List down all the IPL winning teams year-wise?</h3>

#### 25. The groupby() method

In [ ]:
company.head(6)

In [ ]:
sector = company.groupby('Sector')
sector.size()

In [ ]:
sector.get_group('Aerospace & Defense')

In [ ]:
sector.mean()['Revenues'].sort_values(ascending=False)

<h3 style="color:#00a65a">Exercise 8 : Find the top 5 most successful batsman in the hostory of IPL</h3>

In [ ]:
delivery.head(5)

In [ ]:
temp = delivery[delivery['batsman']=='DA Warner']
temp[]

In [ ]:
delivery.groupby('batsman').sum()['batsman_runs'].sort_values(ascending=False).head()

<h3 style="color:#00a65a">Exercise 9 : Find the top 5 batsman who have hit the most number of 6's</h3>

In [ ]:
delivery[delivery['batsman_runs']==6].groupby('batsman').count()['batsman_runs'].sort_values(ascending=False).head()

<h3 style="color:#00a65a">Exercise 10 : Find the top 5 bowlers</h3>

In [ ]:
delivery.head()

In [ ]:
delivery['dismissal_kind'].value_counts()
mask1 = delivery['dismissal_kind']=='caught'
mask2 = delivery['dismissal_kind']=='bowled'
mask3 = delivery['dismissal_kind']=='lbw'
mask4 = delivery['dismissal_kind']=='stumped'
mask5 = delivery['dismissal_kind']=='caught and bowled'
mask6 = delivery['dismissal_kind']=='hit wicket'

wicket = delivery[mask1 | mask2 | mask3 | mask4 | mask5 | mask6]
wicket.groupby('bowler').count()['batsman'].sort_values(ascending=False).head()

<h3 style="color:#00a65a">Exercise 11 : Against which team has Virat Kohli scored most number of his runs?</h3>

In [ ]:
def batsmanVteam(batsman_name):
    vk = delivery[delivery['batsman']==batsman_name]
    result = vk.groupby('bowling_team').sum()['batsman_runs'].sort_values(ascending=False)
    return result
#team = input("enter name of the player : ")
#batsmanVteam(input("enter name of the player : "))

<h3 style="color:#00a65a">Exercise 12 : Against which bowler has Rohit sharma scored most of his runs?</h3>

In [ ]:
#delivery[delivery['batsman']=='R Sharma']

In [ ]:
mega = match.merge(delivery,left_on='id',right_on='match_id')
x = mega.groupby(['season','batsman']).sum()['batsman_runs'].sort_values().reset_index().drop_duplicates(subset='season',keep='last')
x[['season','batsman']].sort_values(ascending=False)

In [ ]:
food.pivot_table(index='City',columns='Frequency',values='Spends',aggfunc='mean')

In [ ]:
#food.pivot_table(index=['City','Item'],columns=['Frequency','Gender'],values='Spends',aggfunc='mean')
delivery.head()
p = delivery[delivery['batsman_runs']==6].pivot_table(index='over',columns='batting_team',values='batsman_runs',aggfunc='count')
import seaborn as sns
sns.heatmap(p,cmap='')

In [72]:
mega = match.merge(delivery,left_on='id',right_on='match_id')
new = mega[mega['over']>=16][['over','ball','batsman','batsman_runs']]
temp = new.groupby('batsman').count()
#temp[temp['batsman_runs']>=200]
#runrate = (y['batsman_runs']/y['ball'])*100
#runrate.sort_values(ascending=False)

In [75]:
mega['season'].unique().sort_values()

AttributeError: 'numpy.ndarray' object has no attribute 'sort_values'